{
	"name": "Mystina",
	"class": "Torturer",
	"race": "Deminai",
	"age": "30",
	"origins": "North Koren",
	"portrait": "https://www.mikkoku.org/img/characters/mystinaavatar.png",
	"loves": "Gore and violence",
	"hates": "Goody two shoes",
	"theme": "rgb(206, 50, 50)",
	"information":
	{
		"personality": "A long time ago, a large number of demons that were imprisoned in Diablos' Dungeon managed to escape from their captivity. They made their way south across the mountains to the human settlement of (South) Koren. Here they did something truly horrifying: they slaughtered all men and children and impregnated most of the women. Through this unsavoury union, a new race was born: the Deminai (which literally translates out to 'demi-demon'). Afterwards, these creatures with demonic blood migrated north and founded a new town known as North Koren, where they have been living ever since. One of the descendants of these first half-demons is Mystina, a young woman. She has developed so much proficiency in torturing her opponents throughout the years that she decided to open a school in which she teaches young deminai the art of torturing. In deminai culture, there is nothing unusual about this at all - in fact, young deminai are encouraged to learn how to kill others in horrifying ways as early as possible. Although she's a rather cruel person in general, she cares deeply for her pupils and will do whatever it takes to protect them. And unlike most other deminai, she does have a rather good perception of what's truly good and what's truly evil.",
		"abilities": "As said before, Mystina is an expert when it comes to torturing her enemies. This becomes crystal clear when you decide to put her in your battle team. All of her skills involve dealing damage to her enemy in an as cruel way as possible. This include driving a wooden stake through her enemy's heart, burning or stoning them to death, confronting her enemies with their own fears, chiselling out their eyeballs from their pockets (making them blind for the remainder of the fight) and more. Additionally, she can also choose to simply behead her opponent with a huge guillotine. It is also worth mentioning that Mystina is the only character who's able to inflict 'Bleed', one of the more powerful 'damage over time' status ailments. Another interesting move she has is 'Punish'. This is a skill that becomes more powerful the closer the party is to losing the battle. It is a great way of exact revenge upon enemies who have caused you trouble. If you choose to disregard her skills, you'll still be left with an amazing fighter. Mystina can equip powerful maces and ball & chains, which means that even if you do nothing else than select 'Fight', her damage output will still be quite high. Additionally, she can equip heavy armour and shields, which means she won't go down easily either."
	}
}