{
	"name": "Thodal",
	"class": "Machinist",
	"race": "Dwarf",
	"age": "39",
	"origins": "Hreidmar, Kingdom of the Dwarves",
	"portrait": "https://www.mikkoku.org/img/characters/thodalavatar.png",
	"loves": "Treasures",
	"hates": "Kobolds",
	"information":
	{
		"personality": "Thodal is a middle-aged dwarf from the great city of Hreidmar. He's a direct cousin of the sailor Wim, who is also, yes, half dwarf. Thodal was sent to the Snowdust region as a digger to help expand the dwarves kingdom's network of caves and tunnels. Because of this, he temporarily had to move to Dvalin, an smaller dwarven settlement below the surface of the Cravalia continent. During his work as a digger in the Snowdust region, he also keeps a keen eye for treasure. For this reason he insists on digging northwards, towards Snowdust Village and the Frozen Castle, because he thinks the Snowdustians may have buried a lot of rare treasures throughout the centuries. Thodal is very prone to mood swings. One moment he's overjoyed, the other moment he's cranky as hell. He can also be pretty stubborn. But above all, he is a very loyal and diligent worker. For this reason, King Mart III of the dwarves has invested a lot of trust in him. Thodal is also pretty good friends with Reto, an engineer working in Hreidmar. To help Thodal with his dangerous job, Reto has developed a couple of useful tools for him to use in combat. After all, most caves are crawling with monsters so he has to be able to defend himself.",
		"abilities": "Thodal's main speciality is his ability to use 'tools' in combat. Obviously, tools are not learned by leveling up, but rather by finding (or buying) them. After obtaining them, you don't have to equip them or anything - just having them in your inventory list is enough. Initially, Thodal begins with only the Hand Cannon (dealing decent non-elemental damage to a single target) and the Flasher (inflicting the blind status on all enemies), but throughout the course of your adventure you will come across many others, such as the Flamethrower and the Missile Launcher. Thodal's buddy Reto will also prove to be a big help - he'll develop the Debugger, which sprays insecticide to deal large damage against all bug-type enemies and the Scanner, which checks his opponents' HP and MP. Two of Thodal's tools are designed for usage on the field map, rather than for battle. These include the Pickaxe, used for destroying small rocks that block your path, and the Shovel, used for digging in soft patches of earth. After Thodal joins you and you obtain the Shovel, you might want to go back to some caves you visited earlier - who knows what you'll find lying beneath the surface! Finally, just like the other dwarf Belzur, Thodal can also use explosives inside and outside of combat, and he, too, uses an axe as his main weapon. The downside to Thodal? Although his tools are great assets, he's one of the slowest characters in the game.",
		"notes": "In 2006 I released the first public version of Mikkoku. (Note, it was still rather unrefined and the game was not nearly as lengthy as it is today.) Nevertheless, because Mikkoku was well received, I decided to work on a sequel, named Mikkoku 2. After working on Mikkoku 2 for more than half a year, I realized that a lot of things in the original Mikkoku could still be improved upon. So I cancelled Mikkoku 2 and went back to perfecting Mikkoku (1). However, I did not want the past few months of work to go to waste, so I reworked some of the stuff made for Mikkoku (2) and brought them over to Mikkoku (1). In the first place, this includes a number of maps and dungeons, most importantly the Nortrora Mountain Pass, the Eastern Woeian Mines and the towns of Laro, Elour, Meomyre, Cape Avalanche, Pounding, Markus, Franco, Dvalin and the underground dwarven capital of Hreidmar. Mikkoku 2 was going to take place about 15 years after the first game and was going to feature a new cast. One of the main characters in the game was going to be the moody, treasure hunting dwarf Thodal. So in addition to the maps I just mentioned, Thodal (and a handful of other characters) was also brought over. The quest in which you meet and recruit him was largely left intact, although it is now an optional sequence rather than a main story sequence. As you can read in the description below, the character uses various tools in combat (items which you have to acquire first). Admittedly, Edgar from Final Fantasy VI was a huge inspiration for this character."
	}
}